In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Stock Prices Data Set.csv")

In [3]:
df.head()

  symbol        date      open      high       low     close    volume
0    AAL  2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
1   AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
2    AAP  2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
3   ABBV  2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
4    ABC  2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391

In [5]:
df.shape

(497472, 7)

In [6]:
df.isnull().sum()

symbol     0
date       0
open      11
high       8
low        8
close      0
volume     0
dtype: int64

In [7]:
df["date"]=pd.to_datetime(df["date"],errors="coerce")

In [8]:
df.head()

  symbol       date      open      high       low     close    volume
0    AAL 2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
1   AAPL 2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
2    AAP 2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
3   ABBV 2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
4    ABC 2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391

In [9]:
numeric_cols=df.select_dtypes(include=["int64","float64"]).columns

In [11]:
df[numeric_cols]=df[numeric_cols].fillna(df[numeric_cols].mean())

In [15]:
df.duplicated().sum()
df=df.drop_duplicates()

In [19]:
df["symbol"]=df["symbol"].str.upper().str.strip()

In [20]:
df.head()

  symbol       date       open       high        low      close        volume
0    AAL 2014-01-02  86.352275  87.132562  85.552467  86.369082  4.253611e+06
1   AAPL 2014-01-02  86.352275  87.132562  85.552467  86.369082  4.253611e+06
2    AAP 2014-01-02  86.352275  87.132562  85.552467  86.369082  4.253611e+06
3   ABBV 2014-01-02  86.352275  87.132562  85.552467  86.369082  4.253611e+06
4    ABC 2014-01-02  86.352275  87.132562  85.552467  86.369082  4.253611e+06

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497472 entries, 0 to 497471
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   symbol  497472 non-null  object
 1   date    497472 non-null  datetime64[ns]
 2   open    497472 non-null  float64
 3   high    497472 non-null  float64
 4   low     497472 non-null  float64
 5   close   497472 non-null  float64
 6   volume  497472 non-null  float64
dtypes: datetime64[ns](1), float64(5), object(1)
memory usage: 26.6+ MB